tutorials/suspensionFoam/RAS/submergedJetScour/initSimpleFoam/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

/*

     8-------------9-----------------10
     |19           |20               |21
     |             |                 |
     |             |                 |
     |             |                 |
     5 - - - - - - 6-----------------7
     |16           |17               |18
     |             |                 |
     |             |                 |
     2-------------3-----------------4
      13           |14               |15
        RIGID BED  |                 |
                   0-----------------1
                    11                12
                    SEDIMENT BED

*/

Hwall           0.1;
Hinlet          0.02;
Hapron          0.005;
Lapron          0.05;
Lsedbed         0.6;
width           0.01;

nxap            20;
nxbed           150;
nzap            6;
nzin            15;
nzwall          50;

gxbed           3;
gxap            1;
gzbed           1;
gzin            2;
gzwall          1;


xin             0;
xapron          #eval{ $xin + $Lapron };
xout            #eval{ $xapron + $Lsedbed };

z0              0;
zbed            #eval{ $z0 - $Hapron };
zmed            #eval{ $z0 + $Hinlet };
ztop            #eval{ $zmed + $Hwall };

vertices        
(
    ($xapron 0 $zbed) // 0
    ($xout 0 $zbed) // 1
    ($xin 0 $z0) // 2
    ($xapron 0 $z0) // 3
    ($xout 0 $z0) // 4
    ($xin 0 $zmed) // 5
    ($xapron 0 $zmed) // 6
    ($xout 0 $zmed) // 7
    ($xin 0 $ztop) // 8
    ($xapron 0 $ztop) // 9
    ($xout 0 $ztop) // 10
    ($xapron $width $zbed) // 0
    ($xout $width $zbed) // 1
    ($xin $width $z0) // 2
    ($xapron $width $z0) // 3
    ($xout $width $z0) // 4
    ($xin $width $zmed) // 5
    ($xapron $width $zmed) // 6
    ($xout $width $zmed) // 7
    ($xin $width $ztop) // 8
    ($xapron $width $ztop) // 9
    ($xout $width $ztop) // 10
    
);

blocks
(
    hex (0 1 12 11 3 4 15 14) ($nxbed 1 $nzap) simpleGrading ($gxbed 1 $gzbed)
    hex (2 3 14 13 5 6 17 16) ($nxap 1 $nzin) simpleGrading ($gxap 1 $gzin)
    hex (3 4 15 14 6 7 18 17) ($nxbed 1 $nzin) simpleGrading ($gxbed 1 $gzin)
    hex (5 6 17 16 8 9 20 19) ($nxap 1 $nzwall) simpleGrading ($gxap 1 $gzwall)
    hex (6 7 18 17 9 10 21 20) ($nxbed 1 $nzwall) simpleGrading ($gxbed 1 $gzwall)
);

edges
(
);

boundary
(
    inlet
    {
        type   patch;
        faces
            (
                (2 5 16 13)
            );
    }
    outlet
    {
        type   patch;
        faces
            (
                (12 15 4 1)
                (15 18 7 4)
                (18 21 10 7)
            );
    }
    rigidWalls
    {
        type   wall;
        faces
            (
                (0 3 14 11)
                (3 2 13 14)
                (5 8 19 16)
            );
    }
    top
    {
        type   patch;
        faces
            (
                (8 9 20 19)
                (9 10 21 20)
            );
    }
    sedimentBed
    {
        type   wall;
        faces
            (
                (11 12 1 0)
            );
    }
    sidesAp
    {
        type empty;
        faces
            (
                (2 3 6 5)
                (5 6 9 8)
                (13 16 17 14)
                (16 19 20 17)
            );
    }
    sidesBed
    {
        type empty;
        faces
            (
                (0 1 4 3)
                (3 4 7 6)
                (6 7 10 9)
                (11 14 15 12)
                (14 17 18 15)
                (17 20 21 18)
            );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
